OpenFOAM_Maincode/test/multiphaseEuler/populationBalance/isothermalGrowth/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default                 none;

    div(phi,alpha)          Gauss vanLeer;
    div(phir,alpha,alpha)   Gauss vanLeer;

    div(phi,U)              Gauss linearUpwind limited;
    div(alphaRhoPhi,U)      Gauss linearUpwind limited;

    "div\(alphaPhi,f*.*\)"  Gauss upwind;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

// ************************************************************************* //
